BusinessProcesses/КампанииОбзвона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<BusinessProcess>
		<Properties>
			<Name>КампанииОбзвона</Name>
			<Comment>Трейд Софт</Comment>
			<Task>Task.КампанияОбзвона</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Повторов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИ</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОператоров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыОператоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приостановлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВЦКТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Операторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оператор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДолговыеОбязательства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолговоеОбязательство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВсеУчаствующиеОператоры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оператор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

AccumulationRegisters/СостоянияПоКатегориям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>СостоянияПоКатегориям</Name>
			<Comment>Трейд Софт</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Скоринг</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСкоринга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Категории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСведения</Name>
			<Comment>Трейд Софт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаданияДляАвтоинформирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗаданияДляАвтоинформирования</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Document.ПринятиеВРаботуОрганизации</xr:Item>
				<xr:Item>Document.ЗавершениеРаботыОрганизации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.АктПередачи</xr:Item>
				<xr:Item>Document.ЗагрузкаЗадолженности</xr:Item>
				<xr:Item>Document.АктуализацияЗадолженности</xr:Item>
				<xr:Item>Document.ПоступлениеПлатежей</xr:Item>
				<xr:Item>Document.ФормированиеПретензионногоПисьма</xr:Item>
				<xr:Item>Document.СкорингДолговыхОбязательств</xr:Item>
				<xr:Item>Document.ПередачаНаВыполнение</xr:Item>
				<xr:Item>Document.ЗапускБП</xr:Item>
				<xr:Item>Document.ПередатьДела</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СостоянияПоАвтоинформированию</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДействийДляСкоринга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстаДляАвтоинформирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоследовательностиКИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНаВыполнение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыДействийДляСкоринга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныТекстаДляАвтоинформирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКИ</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ДолговыеОбязательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ДолговыеОбязательства</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДолговогоОбязательства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДолговыхОбязательств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДоговор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДолжник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКонтрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКредитор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецУслуга</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретАвтообзвона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеконтактныеНомера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтрагента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BusinessProcesses/КампанииОбзвона/Forms/ФормаБизнесПроцесса/Ext/Form/Module.bsl
&НаКлиенте
Процедура Подбор(Команда)
	#Если Не ТолстыйКлиентУправляемоеПриложение Тогда
		Сообщить("Данная опция доступна только под толстым клиентом!");
		Возврат;
	#КонецЕсли
	 
	ОбработкаПодбор = ПолучитьФорму("Обработка.ПодборДО.Форма"); 
		
	Поле = ОбработкаПодбор.Объект.ВыбранныеПоля.Добавить();
	Поле.Имя = "ДолговоеОбязательство";
	Поле.Представление = "Долговое обязательство";
	
	Поле = ОбработкаПодбор.Объект.ВыбранныеПоля.Добавить();
	Поле.Имя = "Должник";
	
	ФормаПодбор = ОбработкаПодбор;
	ФормаПодбор.Объект.ТекстЗапроса = "ВЫБРАТЬ
	                                  |	ДолговыеОбязательстваВРаботеОстатки.Должник КАК Должник,
	                                  |	ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство,
	                                  |	ЕСТЬNULL(ЗадолженностьПоДолговомуОбязательствуОстатки.СуммаРеглОстаток, 0) КАК Задолженность,
	                                  |	ДолговыеОбязательстваДополнительныеРеквизиты.Свойство КАК ДопСвойство,
	                                  |	ДолговыеОбязательстваДополнительныеРеквизиты.Значение КАК ДопЗначение,
	                                  |	ЕСТЬNULL(СостоянияПоКатегориямОстатки.Скоринг, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСкоринга.ПустаяСсылка)) КАК Скоринг,
	                                  |	ЕСТЬNULL(СостоянияПоКатегориямОстатки.Категория, ЗНАЧЕНИЕ(Справочник.Категории.ПустаяСсылка)) КАК Категория
	                                  |ИЗ
	                                  |	РегистрНакопления.ДолговыеОбязательстваВРаботе.Остатки(&Дата, Организация = &Организация) КАК ДолговыеОбязательстваВРаботеОстатки
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоДолговомуОбязательству.Остатки(&Дата, ) КАК ЗадолженностьПоДолговомуОбязательствуОстатки
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = ЗадолженностьПоДолговомуОбязательствуОстатки.ДолговоеОбязательство
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СостоянияПоКатегориям.Остатки(&Дата, ) КАК СостоянияПоКатегориямОстатки
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = СостоянияПоКатегориямОстатки.ДолговоеОбязательство
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК ДолговыеОбязательстваДополнительныеРеквизиты
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = ДолговыеОбязательстваДополнительныеРеквизиты.Ссылка
	                                  |
	                                  |ОБЪЕДИНИТЬ ВСЕ
	                                  |
	                                  |ВЫБРАТЬ
	                                  |	ДолговыеОбязательстваВРаботеОстатки.Должник,
	                                  |	ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство,
	                                  |	ЕСТЬNULL(ЗадолженностьПоДолговомуОбязательствуОстатки.СуммаРеглОстаток, 0),
	                                  |	ДолжникиДополнительныеРеквизиты.Свойство,
	                                  |	ДолжникиДополнительныеРеквизиты.Значение,
	                                  |	ЕСТЬNULL(СостоянияПоКатегориямОстатки.Скоринг, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСкоринга.ПустаяСсылка)),
	                                  |	ЕСТЬNULL(СостоянияПоКатегориямОстатки.Категория, ЗНАЧЕНИЕ(Справочник.Категории.ПустаяСсылка))
	                                  |ИЗ
	                                  |	РегистрНакопления.ДолговыеОбязательстваВРаботе.Остатки(&Дата, Организация = &Организация) КАК ДолговыеОбязательстваВРаботеОстатки
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоДолговомуОбязательству.Остатки(&Дата, ) КАК ЗадолженностьПоДолговомуОбязательствуОстатки
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = ЗадолженностьПоДолговомуОбязательствуОстатки.ДолговоеОбязательство
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СостоянияПоКатегориям.Остатки(&Дата, ) КАК СостоянияПоКатегориямОстатки
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = СостоянияПоКатегориямОстатки.ДолговоеОбязательство
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должники.ДополнительныеРеквизиты КАК ДолжникиДополнительныеРеквизиты
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.Должник = ДолжникиДополнительныеРеквизиты.Ссылка
	                                  |
	                                  |ОБЪЕДИНИТЬ ВСЕ
	                                  |
	                                  |ВЫБРАТЬ
	                                  |	ДолговыеОбязательстваВРаботеОстатки.Должник,
	                                  |	ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство,
	                                  |	ЕСТЬNULL(ЗадолженностьПоДолговомуОбязательствуОстатки.СуммаРеглОстаток, 0),
	                                  |	ДополнительныеСведенияД.Свойство,
	                                  |	ДополнительныеСведенияД.Значение,
	                                  |	ЕСТЬNULL(СостоянияПоКатегориямОстатки.Скоринг, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСкоринга.ПустаяСсылка)),
	                                  |	ЕСТЬNULL(СостоянияПоКатегориямОстатки.Категория, ЗНАЧЕНИЕ(Справочник.Категории.ПустаяСсылка))
	                                  |ИЗ
	                                  |	РегистрНакопления.ДолговыеОбязательстваВРаботе.Остатки(&Дата, Организация = &Организация) КАК ДолговыеОбязательстваВРаботеОстатки
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоДолговомуОбязательству.Остатки(&Дата, ) КАК ЗадолженностьПоДолговомуОбязательствуОстатки
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = ЗадолженностьПоДолговомуОбязательствуОстатки.ДолговоеОбязательство
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СостоянияПоКатегориям.Остатки(&Дата, ) КАК СостоянияПоКатегориямОстатки
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = СостоянияПоКатегориямОстатки.ДолговоеОбязательство
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияД
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.Должник = ДополнительныеСведенияД.Объект
	                                  |
	                                  |ОБЪЕДИНИТЬ ВСЕ
	                                  |
	                                  |ВЫБРАТЬ
	                                  |	ДолговыеОбязательстваВРаботеОстатки.Должник,
	                                  |	ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство,
	                                  |	ЕСТЬNULL(ЗадолженностьПоДолговомуОбязательствуОстатки.СуммаРеглОстаток, 0),
	                                  |	ДополнительныеСведенияДО.Свойство,
	                                  |	ДополнительныеСведенияДО.Значение,
	                                  |	ЕСТЬNULL(СостоянияПоКатегориямОстатки.Скоринг, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСкоринга.ПустаяСсылка)),
	                                  |	ЕСТЬNULL(СостоянияПоКатегориямОстатки.Категория, ЗНАЧЕНИЕ(Справочник.Категории.ПустаяСсылка))
	                                  |ИЗ
	                                  |	РегистрНакопления.ДолговыеОбязательстваВРаботе.Остатки(&Дата, Организация = &Организация) КАК ДолговыеОбязательстваВРаботеОстатки
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоДолговомуОбязательству.Остатки(&Дата, ) КАК ЗадолженностьПоДолговомуОбязательствуОстатки
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = ЗадолженностьПоДолговомуОбязательствуОстатки.ДолговоеОбязательство
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СостоянияПоКатегориям.Остатки(&Дата, ) КАК СостоянияПоКатегориямОстатки
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = СостоянияПоКатегориямОстатки.ДолговоеОбязательство
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияДО
	                                  |		ПО ДолговыеОбязательстваВРаботеОстатки.ДолговоеОбязательство = ДополнительныеСведенияДО.Объект";
	
	//Передаём в обработку параметры запроса.
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата", КонецДня(Объект.Дата));
	СтруктураПараметров.Вставить("Организация", Объект.Организация);
	//СтруктураПараметров.Вставить("ДокументОснование", Объект.ДокументОснование);
	ФормаПодбор.Объект.Параметры = СтруктураПараметров;
	ФормаПодбор.Элементы.ТабличноеПолеДанныеИсполнительныйЛист.Видимость = Ложь;
	
	Результат = ФормаПодбор.ОткрытьМодально();       
	//////РаботаСДокументами.ЗанестиРезультатПодбораВТабличнуюЧасть(Объект.РаспределениеДО, Результат);	
	Если Результат <> Неопределено Тогда
		Объект.ДолговыеОбязательства.Очистить();
		ПодборВтаблЧасть(Результат);
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры



&НаСервере
Процедура ПодборВтаблЧасть(Результат)
	Об = РеквизитФормыВЗначение("Объект");		
	РаботаСДокументами.ЗанестиРезультатПодбораВТабличнуюЧасть(Об.ДолговыеОбязательства, Результат);
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда 
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Повторов = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередСтартом(Отказ)
	Отказ = Истина;
	Объект.Стартован = Истина;
	Объект.Завершен = Ложь;
	//Чуров А.И
	//Объект.КодВЦКТ = СтартоватьВЦКТ();
	//
	Записать();
КонецПроцедуры

&НаСервере
Функция СтартоватьВЦКТ()
	ОбъектЦКТ = ПолучитьИзВременногоХранилища(РаботаСЦКТСервер.АдресОбъектаЦКТ());

	Объект.ВсеУчаствующиеОператоры.Очистить();	
	ОператорыСтрока = "";
	Если Не Объект.ГруппаОператоров.Пустая() Тогда
		Для Каждого Элемент Из Объект.ГруппаОператоров.Операторы Цикл
			Объект.ВсеУчаствующиеОператоры.Добавить().Оператор = Элемент.Оператор;
			ОператорыСтрока = ОператорыСтрока + "," + Формат(Элемент.Оператор.НомерОператора, "ЧГ=");
		КонецЦикла;
	КонецЕсли;	
	Для Каждого Элемент Из Объект.Операторы Цикл
		Если Объект.ВсеУчаствующиеОператоры.НайтиСтроки(Новый Структура("Оператор", Элемент.Оператор)).Количество() = 0 Тогда 
			Объект.ВсеУчаствующиеОператоры.Добавить().Оператор = Элемент.Оператор;
			ОператорыСтрока = ОператорыСтрока + "," + Формат(Элемент.Оператор.НомерОператора, "ЧГ=");		
		КонецЕсли;
	КонецЦикла;
	ОператорыСтрока = Сред(ОператорыСтрока, 2);
	
	
	НовыйБП = ОбъектЦКТ.БизнесПроцессы.КампанияОбзвона.СоздатьБизнесПроцесс();	
	НовыйБП.Дата = ТекущаяДатаСеанса();
	НовыйБП.Приоритет = Объект.Приоритет;
	НовыйБП.Повторов = Объект.Повторов;
	НовыйБП.Операторы = ОператорыСтрока;
	
	ЗапросСведения = Новый Запрос("ВЫБРАТЬ
	                              |	ДополнительныеСведения.Значение
	                              |ИЗ
	                              |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                              |ГДЕ
	                              |	(ДополнительныеСведения.Объект = &Должник
	                              |			ИЛИ ДополнительныеСведения.Объект = &ДО)
	                              |	И ДополнительныеСведения.Свойство = &Свойство");
	ЗапросСведения.УстановитьПараметр("Свойство", Объект.ВидКИ);
	ЗапросРеквизита = Новый Запрос("ВЫБРАТЬ
	                               |	ДолжникиДополнительныеРеквизиты.Значение
	                               |ИЗ
	                               |	Справочник.Должники.ДополнительныеРеквизиты КАК ДолжникиДополнительныеРеквизиты
	                               |ГДЕ
	                               |	ДолжникиДополнительныеРеквизиты.Ссылка = &Должник
	                               |	И ДолжникиДополнительныеРеквизиты.Свойство = &Свойство
	                               |
	                               |ОБЪЕДИНИТЬ ВСЕ
	                               |
	                               |ВЫБРАТЬ
	                               |	ДолговыеОбязательстваДополнительныеРеквизиты.Значение
	                               |ИЗ
	                               |	Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК ДолговыеОбязательстваДополнительныеРеквизиты
	                               |ГДЕ
	                               |	ДолговыеОбязательстваДополнительныеРеквизиты.Ссылка = &ДО
	                               |	И ДолговыеОбязательстваДополнительныеРеквизиты.Свойство = &Свойство");
	ЗапросРеквизита.УстановитьПараметр("Свойство", Объект.ВидКИ);	
	
	
	Для Каждого Элемент Из Объект.ДолговыеОбязательства Цикл	
		Если Объект.ВидКИ.ЭтоДополнительноеСведение Тогда
			ЗапросСведения.УстановитьПараметр("Должник", Элемент.Должник);
			ЗапросСведения.УстановитьПараметр("ДО", Элемент.ДолговоеОбязательство);
			Результат = ЗапросСведения.Выполнить().Выбрать();
		Иначе	
			ЗапросРеквизита.УстановитьПараметр("Должник", Элемент.Должник);
			ЗапросРеквизита.УстановитьПараметр("ДО", Элемент.ДолговоеОбязательство);
			Результат = ЗапросРеквизита.Выполнить().Выбрать();
		КонецЕсли;	
		
		Элемент.Результат = "Нет КИ";
		Если Результат.Следующий() Тогда
			Телефон = Документы.ЗаданияДляАвтоинформирования.ПодготовитьТелефон(Результат.Значение);
			Если ЗначениеЗаполнено(Телефон) Тогда
				Элемент.Результат = "";
				Элемент.УИД = Новый УникальныйИдентификатор();	
				НоваяСтрока = НовыйБП.Абоненты.Добавить();	
				НоваяСтрока.УИАбонента = Строка(Элемент.УИД);
				НоваяСтрока.НомерТелефона = Телефон;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НовыйБП.Записать();
	НовыйБП.Старт();
	Возврат НовыйБП.Номер;
КонецФункции

&НаКлиенте
Процедура СтартоватьИЗакрыть(Команда)
	ПередСтартом(Неопределено);
	Закрыть();
КонецПроцедуры
